
* Overview

  This is a hobby project to use a mini-projector with my eeepc to
  ease DND bookkeepping.

  This will be controlled via an old TV remote, and displayed via a
  web browser.

* web UI

  Uses jquery to fetch the latest IR command, with the HTTP request
  blocking until we get input.

** combat tracker
*** DONE enter to begin
*** DONE list of combatants, up/down to select
*** DONE add a new opponent

    Press the add/erase button

*** DONE remove an opponent

    Select a player, press add/erase, press enter to confirm

*** DONE officially start the combat
    CLOCK: [2010-08-28 Sat 15:17]--[2010-08-28 Sat 16:53] =>  1:36

    Hit power to:
    1. select the first player
    2. start a timer showing how long the combat has lasted

*** DONE cycle through a round
    CLOCK: [2010-08-28 Sat 14:46]--[2010-08-28 Sat 15:04] =>  0:18

    Hit mute to say that player's turn is done, highlight the next
    player
**** DONE Add round number and game time to top of page
     CLOCK: [2010-08-28 Sat 15:17]--[2010-08-28 Sat 15:17] =>  0:00
*** DONE record damage
    CLOCK: [2010-08-28 Sat 17:48]--[2010-08-28 Sat 18:27] =>  0:39

    Highlight a player, hit recall, enter numeric damage, (left is
    backspace, enter is done)

*** DONE move player order

    Adjust left/right buttons
*** DONE tag the current player so mute proceeds as normal if you skip around and assign damage to other players
    CLOCK: [2010-09-14 Tue 18:18]--[2010-09-14 Tue 18:28] =>  0:10
*** DONE make the selected style more prominent, doesn't show up on projector well
*** DONE make monster display differently
    CLOCK: [2010-09-14 Tue 18:04]--[2010-09-14 Tue 18:17] =>  0:13
*** bloodied marker
    CLOCK: [2010-09-14 Tue 18:29]--[2010-09-14 Tue 18:41] =>  0:12
*** HP bar
*** initiative sorter
** post-combat stats display
* Nicer arduino packaging

  The current breadboard wire madness isn't practical, would need to
  be cleaned up and made more robust before it'll survive tableside.

* DONE IR input

  Most of this is completed in my arduino-experiments repo.

* architectury stuff
** DONE use a stack for the UI commands, so we pass the input processor through contexts, and can push/pop
   CLOCK: [2010-08-28 Sat 17:01]--[2010-08-28 Sat 17:32] =>  0:31
** make jquery plugin for player UI so it is easy to update and extend
** separate selected from the current players turn

   so you could select many people then give one damage, or have a
   per-player timer
** package up the page state such that the recall button can be undo
*** keep a list of game states, have a 'render state' function?
    sounds like work, maybe localStorage?
*** keep a stack of functions to run to undo stuff?
** DONE add convenience function for 'press enter' dialog
   CLOCK: [2010-08-28 Sat 17:36]--[2010-08-28 Sat 17:43] =>  0:07

* bugs
** selected/highlighted weirdness with the mute button and allocating damage
